{"joke#1": "`. Add images at the **BOTTOM** with a reference to the image in the README file.", "joke#2": "Question - What is the most used language in programming?\n\nProfanity.", "joke#3": "Question: Why don't keyboards sleep?\nAnswer: Because they have two shifts.", "joke#4": "Q: Which famous rapper knows Assembly?\n\nA: JZ.", "joke#5": "Q: Why do programmers keep pressing the F5 button?\n\nA: Because it’s refreshing.", "joke#6": "Q: What do you call a computer that sings?\n\nA: A dell.", "joke#7": "Q: Why are assembly programmers always soaking wet?\n\nA: Because they work below C level.", "joke#8": "Q:Tell Something About You.(To A Programmer)\n\nA:I'm a writer, but no one in my relatives can read what i write.", "joke#9": "Q: Why do programmers prefer dark mode?\n\nA: Because light attracts bugs", "joke#10": "Q: Favourite actor of a JavaScript Developer is?\n\nA: JSON Statham ![LITTLE BOBBY](./images/E12OmzjXoAAzVvh.jpeg)", "joke#11": "Q: Why do they call it hyper text?\n\nA: Too much JAVA.", "joke#12": "Q: Who won the debate for the best name for loop variable?\n\nA: i won.", "joke#13": "Q: How did the Coder CEO build his company headquarters?\n\nA: By calling the Constructor();", "joke#14": "Q: What is Hardware?\n\nA: The part of the computer which you can kick.", "joke#15": "Q: Who is a programmer?\n\nA: A programmer is a machine who turns coffee into code.", "joke#16": "Question: Why NodeJs developer need Helmet?\n\nAnswer: To Secure Headers.", "joke#17": "Question: What do programmers inherit?\n\nTechnical Debt", "joke#18": "Doom file size 1993 2.39Mb, look how much hard drive space we saved you.\nJPEG image file size 2021 6.23MB, mobile first???\nCALL OF DUTY UPDATE 2021 133.6GB, let them buy an external harddrive!", "joke#19": "And the bartender says, \"Success, but you're not ready!\"\n\nSo a JavaScript function walks into a bar.", "joke#20": "I took a programming class in high school\nI got a C++", "joke#21": "First rule of programming : If it works DON'T touch it.", "joke#22": "Married life of a developer\n\n```\n#wife {\n    right: 100%;\n    margin: 0;\n}\n```", "joke#23": "I would tell you a joke about programming...\n\nBut it only works on my machine", "joke#24": "What is the problem with git jokes?\n\nEveryone has their own version!", "joke#25": "I have a joke about stackoverflow but you will say it's duplicated", "joke#26": "![LITTLE BOBBY](./images/little-bobby.jpg)", "joke#27": "There are two types of People{\n\nand those who\n{\nQuestion: How do you know if someone uses Linux?\n\nAnswer: Don't worry, they'll tell you.", "joke#28": "Best pickup line for a JS dev ?\n\n- Be the promise to my callback ❤️.", "joke#29": "- A QA engineer walks into a bar.\n  Orders a beer. Orders 0 beers.\n  Orders 99999999999 beers.\n  Orders a Iizard. Orders -1 beers.\n  Orders a ueicbksjdhd.\n\n- First real customer walks in\n  and asks where the bathroom\n  is. The bar bursts into flames,\n  killing everyone.", "joke#30": "New programmer : It realy worked at first time.👍\n\nExperienced programmer : It realy worked at first time??🤔", "joke#31": "📄 Documentation is like sex.\n\nWhen it's good, it's very good.\nWhen it's bad, it's better than nothing. 🤷", "joke#32": "99 year old man dying\n\nman: Oh! God, Save Me!!\n\nGod: Ok, JPG or JPEG?", "joke#33": "\"Only my friends get to touch my private parts.\"\n-C++", "joke#34": "Wife: Honey! Can't open the jar.\n\n*Me: Download and install Java.", "joke#35": "Sometimes when I'm writing **Javascript** I want to throw up my hands and say \"this is bullshit!\" but I can never remember what **\"this\"** refers to", "joke#36": "Why do programmers have bad digestion?\n\nThey only have semi-colons", "joke#37": "1st rule of programming:\n\n**If it works, do not touch it!**", "joke#38": "Me: Why isn't this working? 🤔\nNormal Language: You screwed up over here. 🧐\nMe: Oh Thanks! 👍\n\nMe: Why isn't this working? 🤔\nJavaScript: SHHHHHH! 🤫", "joke#39": "Data scientists should be charged with animal trafficking and animal abuse because they import pandas and feed them to python.", "joke#40": "![Confidence level of a Programmer](./images/confidenceJoke.jpeg)", "joke#41": "A logician's wife is having a baby.\nThe doctor immediately hands the newborn to the dad.\nThe wife asks impatiently \"Is it a boy or a girl?\"\nThe logician replies \"Yes.\"", "joke#42": "The programmer to his son: \"Here, I brought you a new basketball.\"\n\"Thank you, daddy, but where is the user's guide?\"😜", "joke#43": "Once all programming languages went to a party.\nGuess who paid the bill?\nOf course, PHP.\nBeacause PHP has many $.", "joke#44": "A fool can write a code that a computer can understand.\nGood programmers write code that they also don't understand after few days.", "joke#45": "I've been using VIM since about 5 years because I never find out how to quit.", "joke#46": "If an EXE file says:\n\"This program requires Windows XP or better...\"\nDoes that mean that it'll run linux..? :)", "joke#47": "To replace programmers with robots, clients will have to accurately describe what they want.\n\nWe are safe! 😏", "joke#48": "A guy ordered a pizza with cheese, olives, onion and red pepper. On getting it, the guy shouted - It is not baked.\n\nDelivery guy - You only get what you ask for.", "joke#49": "If somebody refers me for a job 👨‍💻 will it be considered 'pass by reference' or 'pass by value'? 🤔😂", "joke#50": "Once C++ walks into a bar and sees C.\n\nC is drunk, falling on the floor, spitting and swearing.\n\nHow classless! -says C++", "joke#51": "Are you a RESTful API? because you GET my attention, PUT some love, POST the cutest smile, and DELETE my bad day", "joke#52": "I used to know a joke about Java, but I run out of memory.", "joke#53": "Why do Front-End Developers eat lunch alone?\n\nBecause, they don't know how to join tables.", "joke#54": "I am declaring a war.\nvar war;", "joke#55": "Knock knock\n\nUnsynchronized block\n\nWho's there?", "joke#56": "“Knock, knock.”\n\n“Who’s there?”\n\nvery... long... pause...\n\n“Java.”", "joke#57": "There are 10 types of people in the world: those who understand binary, and those who don’t.", "joke#58": "walks UDP package into bar A.", "joke#59": "I would tell you a joke about UDP, but I don't know if you will get it.\n\nEither way, I don't care.", "joke#60": "A SQL query goes into a bar, walks up to two tables and asks, \"Can I join you?\"", "joke#61": "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.", "joke#62": "Knock knock.\n\nWhos there?\n\nBroken state machine.\n\nBroken state machine who?\n\nKnock knock.", "joke#63": "pisa-tower {\n      font-style: italic;\n    }", "joke#64": "Two bytes meet.  The first byte asks, “Are you ill?”\nThe second byte replies, “No, just feeling a bit off.”", "joke#65": "1/3 of US bandwidth is used by Netflix.\n\nthe rest is used by `rm -rf node_modules && npm install`", "joke#66": "Debugging: Being the detective in a crime movie where you are also the murderer.", "joke#67": "Behind every good program is a frustrated programmer.", "joke#68": "Being a Programmer and watching someone HACK a computer on a TV show is like a nurse and watching someone in the movie take blood with a carrot.", "joke#69": "Programmer 1: We have a problem!\nProgrammer 2: Let’s use RegEx!\nProgrammer 1: Now we have two problems.", "joke#70": "My girlfriend dumped me after I named a class after her. She felt I treated her like an object.", "joke#71": "Trying to fix the problem I created when I tried to fix the problems I created when I tried to fix the problems I created when there was a problem", "joke#72": "A programmer’s wife asks: “Would you go to the shop and pick up a loaf of bread? And if they have eggs, get a dozen.”\n\nThe programmer returns home with 12 loaves of bread.\n\n“They had eggs.”", "joke#73": "Q: What do you call a programmer from Finland?\n\nA: Nerdic", "joke#74": "Question - How did the developer announce her engagement?\n\n`this.engaged = true`", "joke#75": "Question - Why is the Javascript developer sad?\n\nBecause they do not Node how to Express themselves.", "joke#76": "Question - How do you comfort a JavaScript bug?\n\nYou console it.", "joke#77": "Question - Why couldn't the React component understand the joke?\n\nIt didn't get the context.", "joke#78": "Question - Why did the JavaScript developer leave?\n\nBecause she didn't get arrays", "joke#79": "Question - What is the object-oriented way to become wealthy?\n\nInheritance.", "joke#80": "Question - Why do functions always break up?\n\nBecause they have constant arguments.", "joke#81": "Question - Why do programmers get confused between Halloween and Christmas?\n\nBecause OCT 31 = DEC 25", "joke#82": "Question - What is programmer's favourite hangout place?\n\nFoo Bar", "joke#83": "Question - What kind of doctors fixes broken websites?\n\nA URLogist", "joke#84": "Question - Why does no one likes SQLrillex?\n\nHe keeps dropping the database", "joke#85": "Question - How did html get drunk?\n\nIt had too many <br/>", "joke#86": "Question: Why do C# and Java developers keep breaking their keyboards ?\n\nBecause they use a strongly typed language.", "joke#87": "Question - Why did the developer die in the shower?\n\nHe read the shampoo bottle instructions: Lather. Rinse. Repeat.", "joke#88": "Question - Why do fish not like React?\n\nBecause it has Hooks 😂.", "joke#89": "Question - How long does a loop last?\n\nFor a while", "joke#90": "Question - What did the developer said to the repository?\n\nFORK YOU!", "joke#91": "Question: What do you call the security outside of a samsung store?\n\nGuardians of the Galaxy", "joke#92": "Question: Why does Python live on land?\n\nBecause it's above C-level", "joke#93": "Question - How are computers and air conditioners similar?\n\nThey are both useless when you open windows", "joke#94": "Question - Who is a programmer?\n\nAnswer: A person who fixed a problem that you don't know you have, in a way you don't understand.", "joke#95": "Question - Why do Java developers wear glasses?\n\nAnswer: Because they can't C# !", "joke#96": "Question - How do functions break up?\n\nAnswer: They stop calling each other.", "joke#97": "Question - 0 is false and 1 is true, right?\n\nAnswer: 1", "joke#98": "Question: How many programmers does it take to change a light bulb?\n\nAnswer: None – It’s a hardware problem", "joke#99": "Question - Why do software engineers consistently stir up Halloween and Christmas?\n\nAnswer: Because  Oct 31 = Dec 25", "joke#100": "Question - Have you heard of the band with 1023 megabytes?\n\nNo, they just haven't had a gig yet.", "joke#101": "Question - What screams \"I'm insecure\"?\n\nHttp", "joke#102": "Question - Why dod the software developer go broke?\n\nThey used up all their cache.", "joke#103": "Question - Why did the react class component feel relieved?\n\nBecause it was now off the hook.", "joke#104": "Question - Why did the child component have such great self-esteem?\n\nBecause its parent kept giving it props!", "joke#105": "Question - Which type of shooting always hurt the shooter?\n\nTrouble-shooting!", "joke#106": "Question- What's the object oriented way to become wealthy?\nAnswer  - Inheritance.", "joke#107": "Conversation between layman and developer\n\n-   layman: Hey! What's your address\n-   developer: 173.168.15.10\n-   layman: No man. Your local address\n-   developer: 127.0.0.1\n-   layman: I mean your physical address\n-   developer: 29.01.38.62.31.58", "joke#108": ":boy: : I like you, do you want to be my GF?\n\n:girl: : ... (30 seconds)\n\n:boy: : Why are you quiet?\n\n:girl: : ... (30 seconds). \"504 Gateway Timeout\"", "joke#109": " Pointers in C:\n\n\"I know a guy who knows a guy... who knows another guy\"", "joke#110": "Two strings walk into a bar and sit down. The bartender says, “So what’ll it be?”\n\nThe first string says, “I think I’ll have a beer quag fulk boorg jdk^CjfdLk jk3s d#f67howe%^U r89nvy\\~~owmc63^Dz x.xvcu”\n\n“Please excuse my friend,” the second string says, “He isn’t null-terminated.”", "joke#111": "What do the new MacBook and a black hole have in common?\n\nThere's no Escape!", "joke#112": "One man's constant is another man's variable", "joke#113": "Android: where ProgressBars go around in circles and Spinners don’t spin", "joke#114": "I showed my 12 year son aa floppy disk....\nHe said \"ohh nice!! You have 3-D printed the save icon.\"", "joke#115": "All programmers are playwrights, and all computers are lousy actors", "joke#116": "\"Don't call me, I'll callback you. I promise!\"", "joke#117": "\"How did your dog eat your coding assignment?\"\nIt took him a couple bytes", "joke#118": "I would love to change the world, but they won’t give me the source code.", "joke#119": "Python and PHP.\n\nOne of these two is one of the most popular choices of backend programming. The other one is PHP.", "joke#120": "Dad: So what do you want to do when you grow up?\n\nKid: Engineering\n\nDad: Oh great, so you want to become an engineer?\n\nKid: No, I want 4 more years to decide what I want to do", "joke#121": "A successful programmer is a PRO in GRAMMAR!", "joke#122": "A journalist asked a programmer:-what makes code bad?\n\nProgrammer:- No comment", "joke#123": "Chuck Norris doesn’t bug hunt, he goes bug killing.", "joke#124": "why do Elm developers type so loudly?\n\ncause it's a strongly typed language.", "joke#125": "Chuck Norris don’t need passwords to access your system, he simply types \\* and system gives him access.", "joke#126": "Ford is creating a line of electric cars that use Tesla parts and software. They're calling it Edison.", "joke#127": "I see this person every day who is huge by the way and yet everybody ignores that person.\nDo you wanna know who?\n\nnode underscore modules\n\nWrong middle name anyways!", "joke#128": "{\n \"devjoke\":\"people with name Jason might have felt invalid once JSON came into picture\"\n}", "joke#129": "I have a dev joke, but I couldn't debug it 😭", "joke#130": "Forgetting the semicolon after every C command and getting an error makes me go ;_;", "joke#131": "any one know any joke about sodium??\nNA", "joke#132": "There are three kinds of lies: Lies, damned lies, and benchmarks.", "joke#133": "- How do you tell HTML from HTML5?\n- Try it out in Internet Exlorer.\n- Did it work?\n- No?\n- It's HTML5.", "joke#134": "I went on a date. The girl said \" Pass the salt \". I replied \" Pass by value or by reference!\"", "joke#135": "A journalist asked a programmer:-what makes code bad?\nProgrammer:- No comment", "joke#136": "![Assembly](./images/assembly_pointers.png)\n\nA physicist, an engineer and a programmer were in a car driving over a steep alpine pass when the brakes failed. The car was getting faster and faster, they were struggling to get round the corners and once or twice only the feeble crash barrier saved them from crashing down the side of the mountain. They were sure they were all going to die, when suddenly they spotted an escape lane. They pulled into the escape lane, and came safely to a halt.\n\nThe physicist said \"We need to model the friction in the brake pads and the resultant temperature rise, see if we can work out why they failed\".\n\nThe engineer said \"I think I've got a few spanners in the back. I'll take a look and see if I can work out what's wrong\".\n\nThe programmer said \"Why don't we get going again and see if it's reproducible?\"", "joke#137": "I now understand why english grammar was taught in school,because it takes me a while to think the difference between \"sign up\" and \"sign in\" before i click the wrong one.", "joke#138": "I keep trying to understand angular.\n\nBut its just so obtuse", "joke#139": "Guy 1: Its so cold, the heater has stopped working !!\nAndroid Dev: (Turns on Android Studio) There you go !", "joke#140": "Son: Dad, why do the sun rise in east and set in west ?\nProgrammer dad: hey, it works!! Don't touch it ;", "joke#141": "A programmer walks to the butcher shop and buys a kilo of meat.  An hour later he comes back upset that the butcher shortchanged him by 24 grams.", "joke#142": "The best thing about a Boolean is even if you are wrong, you are only off by a bit.", "joke#143": " Question: What's did the Git engineer ask the waitress for?\n\nAnswer: A fork.", "joke#144": " Q. In a world where computer programs were TV shows, why would a JS program never be a reality TV show?\nAns. - because it's scripted.", "joke#145": "mother {\n  right: 100%;\n  margin: 0;\n}", "joke#146": "She: You told me you were fullstack!\nMe: Full Stackoverflow", "joke#147": "Question: What is a computer's favorite beat?\nAnswer: An algo-rhythm", "joke#148": "Friend: you both look like a cute couple!! where did you find her? tinder or insta?\nMe: GITHUB", "joke#149": "A user interface is like a joke.\nIf you have to explain it,It's not that good 😃 😀 😄", "joke#150": "Android: where ProgressBars go around in circles and Spinners don’t spin", "joke#151": "What did the Python say when he came out of his shell?\nPrint(\"Hello World!\")", "joke#152": "I showed my 12 year son aa floppy disk....\nHe said \"ohh nice!! You have 3-D printed the save icon.\"", "joke#153": "All programmers are playwrights, and all computers are lousy actors", "joke#154": "Algorithm :\n\nWords used by a programmer when they don't want to explain what they did.", "joke#155": "I had a problem earlier, then I started using Java.\nNow I've a ProblemFactory.", "joke#156": "Me during my AI Presentation:\nI have some good markov jokes, but really if you've heard one you've heard them all.", "joke#157": "Eight bytes walk into a bar.  The bartender asks, “Can I get you anything?”\n“Yeah,” reply the bytes.  “Make us a double.”", "joke#158": "Programmer: Son, can you count to 10?\n3 yr old son: 1...2...\nProgrammer: Stop. You are not my son,", "joke#159": "The Profession is Programming. But, all they do is create New Objects.", "joke#160": "To understand what recursion is, you must first understand recursion.", "joke#161": "Non-Programmer - You can't keep doing the same thing and expect different results🧐\n\nProgrammer- Let me introduce you to \"DEBUGGING\"💻⚠", "joke#162": " What is a ghost's favourite type?\n\nAnswer: Boooooooolean.", "joke#163": " I'd like to make the world a better place...\n\nBut they won't give me the source code.", "joke#164": "![Assembly](./images/assembly_pointers.png)", "joke#165": "![new_painitingai](https://user-images.githubusercontent.com/72219783/94889728-d0d49700-049a-11eb-85f1-40ddd7d76c6d.jpg)", "joke#166": "![titanic](./images/titanic-float-none.png)", "joke#167": "![GoTo Hell](./images/new_hell.jpg)", "joke#168": "![runtimeError](./images/runtimeError.jpg)", "joke#169": "![semicolon](./images/joke-semi-colon.jpg)", "joke#170": "![betterThanSex](images/better-than-sex.jpg)", "joke#171": "![Warning](./images/warnings-error.jpg)", "joke#172": "![doctors](./images/doctors.jpg)", "joke#173": "![async](./images/async.png)", "joke#174": "![Python Space](./images/space-python.png)", "joke#175": "![Python 4](./images/cat_invasion_python4.jpeg)", "joke#176": "![gitignore](./images/gitignore.jpg)", "joke#177": "![Machine Learning](./images/machine-learning2.png)", "joke#178": "![OOP](./images/poop.png)", "joke#179": "![Broken Build](./images/build-is-broken.png)", "joke#180": "![Cloud](./images/clouds.png)", "joke#181": "![Cookies](./images/cookies.png)", "joke#182": "![Distracted Dev](./images/distracted-dev.png)", "joke#183": "![Eminem](./images/eminem.png)", "joke#184": "![Functions](./images/functions.png)", "joke#185": "![Git commit](./images/git-commit.png)", "joke#186": "![GraphQL](./images/graphql.png)", "joke#187": "![Love](./images/love.png)", "joke#188": "![Machine Learning](./images/machinelearning.png)", "joke#189": "![Marie Kondo](./images/marie-kondo.png)", "joke#190": "![New Framework](./images/new-framework.png)", "joke#191": "![Pointer](./images/pointer.png)", "joke#192": "![Redux and GraphQL](./images/reduxandgraphql.png)", "joke#193": "![Santa](./images/santa.png)", "joke#194": "![Tests](./images/tests.png)", "joke#195": "![Undefined](./images/undefined.png)", "joke#196": "![While Do Loop](./images/while-do.png)", "joke#197": "![z-index](./images/z-index.png)", "joke#198": "![null](./images/0-null.png)", "joke#199": "![docker](./images/docker.jpg)", "joke#200": "![java](./images/garbage-collector.png)\n\n(.images/webjava.jpg)", "joke#201": "![gitcommit](./images/uselessgit.jpeg)", "joke#202": "![backend vs frontend](./images/backendVSfrontend.png)", "joke#203": "![Father-Son-Web-Developer](./images/Father-son-web-dev-joke.jpg)", "joke#204": "![Why did the c# developer fall asleep](./images/joke-why-did-the-c-developer-fall-asleep.png)", "joke#205": "![Regular Expression](./images/regularExpression.jpg)", "joke#206": "![string](./images/string.jpg)", "joke#207": "![debugger](./images/console-log-debugger.jpg)", "joke#208": "![documentation](./images/documentation.jpg)", "joke#209": "![JavaScript Arrays](./images/javascript-arrays.jpg)", "joke#210": "![Using VS to open JSON](./images/open_json_in_vs.jpg)", "joke#211": "![qa engineer walks into a bar](./images/qaengineerwalksintoabar.png)", "joke#212": "![java](./images/android-kot-java.jpg)", "joke#213": "![java](./images/skeleton.jpg)", "joke#214": "![security](./images/security.png)", "joke#215": "![cluedont](https://raw.githubusercontent.com/shrutikapoor08/devjoke/aa1789ca045c6106a61173fe794466646da47629/images/joke-usb.jpg)", "joke#216": "![java](./images/tattoo.jpeg)", "joke#217": "![debugging](./images/Debugging.jpg)", "joke#218": "![error](./images/error.jpg)", "joke#219": " Question - Why integration testing is required after unit testing?\n\nAnswer: ![umbrella](./images/umbrella.gif)", "joke#220": "![objectOrientedJoke](./images/object-oriented-joke.jpg)", "joke#221": "![land-hover](./images/land-hover.jpg)", "joke#222": "![intkaam](./images/intkaam.jpeg)", "joke#223": "![Codebase](./images/WaysToSaveUrCode.jpeg)", "joke#224": "![webdev](./images/frontend-before-backend.jpg)", "joke#225": "![DND](./images/dnd.png)", "joke#226": "![gitignore-Joke](./images/gitignore-joke.jpg)", "joke#227": "![programmer-joke](./images/programmer-joke.jpg)", "joke#228": "![where is the Github source code?](./images/github_joke.jpg)\n\n\n![CanI?](./images/ComunismOfClass.jpeg)", "joke#229": "![sql-join](./images/sql-join.jpg)", "joke#230": "Son: Dad, why do the sun rise in east and set in west ?\nProgrammer dad: hey, it works!! Don't touch it ;", "joke#231": "A programmer walks to the butcher shop and buys a kilo of meat.  An hour later he comes back upset that the butcher shortchanged him by 24 grams.", "joke#232": "The best thing about a Boolean is even if you are wrong, you are only off by a bit.", "joke#233": " Question: What's did the Git engineer ask the waitress for?\n\nAnswer: A fork.", "joke#234": " Q. In a world where computer programs were TV shows, why would a JS program never be a reality TV show?\nAns. - because it's scripted.", "joke#235": "mother {\n  right: 100%;\n  margin: 0;\n}", "joke#236": "She: You told me you were fullstack!\nMe: Full Stackoverflow", "joke#237": "![Java joke](./images/javaJoke.png)", "joke#238": " What is a computer's favorite beat?\nAnswer: An algo-rhythm", "joke#239": " If Programming Languages Were To Propose:\n\nJava: I promise there hasn’t been a day that I stopped wanting you and haven’t gotten out of my head at all since I first met you!!\n\nPython: I love you ;)", "joke#240": "Ubuntu users are apt to get this joke", "joke#241": " What do you call a programmer from Finland? \nAnswer: Nerdic", "joke#242": "An Algorithm a day, Keeps a mass recruiter away.", "joke#243": "![gmail-check](./images/gmail-check.png)", "joke#244": "What did the router say to the doctor?\n“It hurts when IP”", "joke#245": "![productionTesting](./images/productionTesting.jpg)", "joke#246": "![legacy-code](./images/legacy-code.png)", "joke#247": "To replace programmers with robots, clients will have to accurately describe what they want.\nWe are safe.", "joke#248": "I love pressing the F5 key. It's refreshing.", "joke#249": "Chuck Norris’s keyboard doesn’t have a Ctrl key because nothing controls Chuck Norris.", "joke#250": " Question: Why do programmers and coders hate nature?\n\nAnswer: It has too many bugs.", "joke#251": " What would you call a web developer who enjoys finding bugs?\nAnswer: spider", "joke#252": " Why is shipping code a lie?\n\nAnswer: Because every deploy has \"ploy\" in it.", "joke#253": "Autocorrect can go straight to he’ll. —Constance Normandeau", "joke#254": " What did the Java code say to the C code?\n\nAnswer: You've got no class.", "joke#255": "Did you hear about the monkeys who shared an Amazon account? They were Prime mates.", "joke#256": "Due to Coronovirus (COVID19) all TCP applications are being converted to UDP to avoid Handshakes..!!", "joke#257": "Q: Why do kayakaers make bad programmers?\nA: Because they are afraid of waterfall.", "joke#258": "One thing I know is that a computer science major didn't name the original pokemon.\nOtherwise, charmander would evolve into stringmander.", "joke#259": "Me: Alexa, I would like to hear a TCP joke.\n\nAlexa: Hi, would you like to hear a TCP joke?\n\nMe: Yes, I would like to hear a TCP joke.\n\nAlexa: I'm about to tell you a TCP joke. It will last 10 seconds. It has a beginning and a solid punchline in the end.\n\nMe: Ok. Hit it. I'm excited to hear a TCP joke.\n\nAlexa: Sorry, your connection has timed out.\n\n...\n\nAlexa: Hi, would you like to hear a TCP joke? kkkk", "joke#260": "Girl: What is your idea of perfect date?\nBoy: DD/MM/YYYY because other formats can be confusing \n\nIn order to understand recursion, one must first understand recursion.", "joke#261": "![DEVExcuses](./images/96159609_699388344131798_2782988831844990976_o.jpg)", "joke#262": "![Frontend_Backend](./images/j55.jpg)", "joke#263": "![DeveloperLife](./images/j11.jpg)", "joke#264": "![DeveloperLife](./images/ProgammersvsRestofHumans.jpeg)", "joke#265": "**Python Pro** : _The easiest language to learn, no braces, no mains, no boilerplate codes._</br>\n**Python Noob** : _Gets indentation errors on adding extra spacing!_</br>\n![python joke](https://i.imgur.com/LKYCGfX.jpg)", "joke#266": "Code is like humor. When you have to explain it, it’s bad.", "joke#267": "![Debugging](./images/Debug.png)", "joke#268": "![StackOverflowPro](./images/stack-overflow-pro.jpg)", "joke#269": "![HurtDoggy](./images/hurt-doggy.jpg)", "joke#270": "![Documentation](./images/writing_documentation_todo.png)", "joke#271": "![HacktoberScam](./images/HacktoberScam.jpg)", "joke#272": "![Software Development Meme](https://i.imgur.com/yA8LwHY.png)", "joke#273": " What is a developer's favorite country song?\n\nAnswer: Hello World - by Lady Antebellum", "joke#274": "What do cupboards and Java have in common?\n\nJars.", "joke#275": "![StartupMotivation](./images/startup-motivation.jpg)", "joke#276": "![Memory](./images/memory.jpg)", "joke#277": "![Meaningful Messages](./images/meaningful_commits.png)", "joke#278": "Son : Dad, I feel like i am a programmer now.\nFather : Talk is cheap, Show me the code.", "joke#279": "![Howto_Google](./images/howtogoogle.jpg)", "joke#280": "![Error 404 AM, sleep not found](./images/sleep-not-found.jpg)", "joke#281": "![sql-join](./images/sql-join.jpg)", "joke#282": "![Program_mess](./images/programmess.jpg)", "joke#283": "![python-joke](https://user-images.githubusercontent.com/42266013/136796032-c6f8b57c-fa78-482f-93cc-b2077a197a55.jpg)", "joke#284": "A programmer's wife tells him, \n\"While you're at the grocery store, buy some eggs.\"\nHe never comes back.", "joke#285": "![The Weekend Is Here](./images/weekend.jpg)", "joke#286": "Programmer (noun.) - A person who fixed a problem that you don't know you have, in a way you don't understand.", "joke#287": "![PerfectDate](./images/joke.jpg)", "joke#288": "![BinaryTree](./images/245043822_4384448964937281_5019590283933767997_n.jpeg)", "joke#289": "![Ctrl_Alt_Delete](./images/Ctrl_Alt_Delete.jpg)", "joke#290": "", "joke#291": "Software and cathedrals are much the same — first we build them, then we pray.", "joke#292": ""}